{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-LOCATION",
    "4": "I-LOCATION",
    "5": "B-FINANCIAL",
    "6": "I-FINANCIAL",
    "7": "B-CONTACT",
    "8": "I-CONTACT",
    "9": "B-CREDENTIAL",
    "10": "I-CREDENTIAL"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-CONTACT": 7,
    "B-CREDENTIAL": 9,
    "B-FINANCIAL": 5,
    "B-LOCATION": 3,
    "B-PERSON": 1,
    "I-CONTACT": 8,
    "I-CREDENTIAL": 10,
    "I-FINANCIAL": 6,
    "I-LOCATION": 4,
    "I-PERSON": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 28996
}
